const INTRODUCTION_TEXT = `こ日は или же 'Привет' на твоём языке 😁

Меня зовут Соня 😇
Я универсальный помощник учебной группы

📩 Отправь мне свое домашнее задание и я его надёжно　сохраню ✅ 
А когда тебе нужна будет сохраненная домашка, просто попроси меня! 👌

Внизу ты можешь выбрать одно из опций!
`;
const INVALID_MESSAGE = `😞 К сожалению, я только понимаю команды! 
Может если бы вы мне подарили свой мозг🧠
я бы понимала лучше) 🤩
        `;
// BUTTONS
const BTN_TEXT_GET_ACTION = "Получить дз";
const BTN_TEXT_UPLOAD_ACTION = "Сохранить дз";

// BUTTONS END
const MAIN_MENU_TEXT = "Выберите одно из опций";
const HOMEWORK_UPLOAD_MESSAGE = "Впишите домашнее задание";
const UPLOAD_SUCCESS_MESSAGE = "✅ Готово";
const CANCEL_OPERATION_SUCCESS_MESSAGE = "Операция была отменена";
const ERROR_MESSAGE =
  "Упс...кажись разработчик написал ещё одну ошибку, если вы видите это сообщение то пожалуйста сообщите ему";
const CANCEL_OPERATION_ERROR_MESSAGE = "Походу тут нечего отменять";
const ERROR_DOC_UPLOAD_MESSAGE =
  "К сожалению загрузка документов не поддерживается на данный момент";
const UPLOAD_LIMIT_REACHED_MESSAGE = "Достигнут лимит по загрузка текстовой информации";
const NO_ACTION_CHOOSEN = "УПС...а сперва нужно выбрать предмет";
module.exports = {
  MAIN_MENU_TEXT,
  HOMEWORK_UPLOAD_MESSAGE,
  UPLOAD_SUCCESS_MESSAGE,
  CANCEL_OPERATION_SUCCESS_MESSAGE,
  ERROR_MESSAGE,
  CANCEL_OPERATION_ERROR_MESSAGE,
  ERROR_DOC_UPLOAD_MESSAGE,
  UPLOAD_LIMIT_REACHED_MESSAGE,
  INVALID_MESSAGE,
  INTRODUCTION_TEXT,
  NO_ACTION_CHOOSEN,
  BTN_TEXT_GET_ACTION,
  BTN_TEXT_UPLOAD_ACTION,
};
