const INTRODUCTION_TEXT = `こ日は или же 'Привет' на твоём языке 😁

Меня зовут Соня 😇
Я твой помощник с домашкой!

📩 Отправь мне свое домашнее задание и я его надёжно　сохраню ✅ 
А когда тебе нужна будет сохраненная домашка, просто попроси меня! 👌

Внизу ты можешь выбрать одно из опций!
`;
const MAIN_MENU_TEXT = "Выберите одно из опций";
const HOMEWORK_UPLOAD_MESSAGE = "Впишите домашнее задание";
const UPLOAD_SUCCESS_MESSAGE = "Отлично!";
const SUBJECT_NAMES = [
  "математика",
  "русский",
  "история",
  "физика",
  "химия",
  "география",
  "биология",
  "обж",
  "информатика",
  "литература",
];
const UPLOAD_BTN_NAME = "upload-homework";
const GET_BTN_NAME = "get-homework";
module.exports = {
  SUBJECT_NAMES,
  INTRODUCTION_TEXT,
  UPLOAD_BTN_NAME,
  GET_BTN_NAME,
  HOMEWORK_UPLOAD_MESSAGE,
  UPLOAD_SUCCESS_MESSAGE,
  MAIN_MENU_TEXT,
};
